---
type: LayoutRuleFixedNumber
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# LayoutRuleFixedNumber

`Autodesk.Revit.DB.LayoutRuleFixedNumber` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LayoutRuleFixedNumber | — | `public LayoutRuleFixedNumber ( int numberOfLines )` |
| Property | NumberOfLines | — | `public int NumberOfLines { get ; set ; }` |